vsfteam/vsf.demo/board/gd32h7xx/vsf_board.c
/*****************************************************************************
 *   Copyright(C)2009-2022 by VSF Team                                       *
 *                                                                           *
 *  Licensed under the Apache License, Version 2.0 (the "License");          *
 *  you may not use this file except in compliance with the License.         *
 *  You may obtain a copy of the License at                                  *
 *                                                                           *
 *     http://www.apache.org/licenses/LICENSE-2.0                            *
 *                                                                           *
 *  Unless required by applicable law or agreed to in writing, software      *
 *  distributed under the License is distributed on an "AS IS" BASIS,        *
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. *
 *  See the License for the specific language governing permissions and      *
 *  limitations under the License.                                           *
 *                                                                           *
 ****************************************************************************/

/*============================ INCLUDES ======================================*/

#define __VSF_SIMPLE_STREAM_CLASS_INHERIT__
#include "./vsf_board.h"

#include "hal/driver/GigaDevice/GD32H7XX/common/vendor/Include/gd32h7xx.h"

/*============================ MACROS ========================================*/

#if VSF_USE_UI == ENABLED && VSF_DISP_USE_FB == ENABLED
#   ifndef VSF_BOARD_RGBLCD_LAYER0_WIDTH
#       define VSF_BOARD_RGBLCD_LAYER0_WIDTH        VSF_BOARD_RGBLCD_WIDTH
#   endif
#   ifndef VSF_BOARD_RGBLCD_LAYER0_HEIGHT
#       define VSF_BOARD_RGBLCD_LAYER0_HEIGHT       VSF_BOARD_RGBLCD_HEIGHT
#   endif
#   ifndef VSF_BOARD_RGBLCD_LAYER0_COLOR
#       define VSF_BOARD_RGBLCD_LAYER0_COLOR        VSF_BOARD_RGBLCD_COLOR
#   endif
#endif

/*============================ MACROFIED FUNCTIONS ===========================*/
/*============================ TYPES =========================================*/
/*============================ PROTOTYPES ====================================*/
/*============================ LOCAL VARIABLES ===============================*/

#if VSF_USE_USB_HOST == ENABLED
static const vk_dwcotg_hcd_param_t __dwcotg_hcd_param = {
    .op                         = &VSF_USB_HC0_IP,
    .priority                   = APP_CFG_USBH_ARCH_PRIO,
};
#endif

#ifdef VSF_BOARD_RGBLCD_LAYER0_SRAM_BUFFER_T
static VSF_BOARD_RGBLCD_LAYER0_SRAM_BUFFER_T __vsf_hw_rgblcd_layer0_fb
    [2][VSF_BOARD_RGBLCD_LAYER0_WIDTH * VSF_BOARD_RGBLCD_LAYER0_HEIGHT] VSF_CAL_ALIGN(8);
#endif

#   if      defined(VSF_BOARD_RGBLCD_LAYER1_WIDTH)                              \
        &&  defined(VSF_BOARD_RGBLCD_LAYER1_HEIGHT)                             \
        &&  defined(VSF_BOARD_RGBLCD_LAYER1_COLOR)                              \
        &&  defined(VSF_BOARD_RGBLCD_LAYER1_SRAM_BUFFER_T)
static VSF_BOARD_RGBLCD_LAYER1_SRAM_BUFFER_T __vsf_hw_rgblcd_layer1_fb
    [2][VSF_BOARD_RGBLCD_LAYER1_WIDTH * VSF_BOARD_RGBLCD_LAYER1_HEIGHT] VSF_CAL_ALIGN(8);
#endif

/*============================ GLOBAL VARIABLES ==============================*/

#if VSF_USE_USB_DEVICE == ENABLED
static const vk_dwcotg_dcd_param_t __dwcotg_dcd_param = {
    .op                         = &VSF_USB_DC0_IP,
    .speed                      = VSF_USBD_CFG_SPEED,
        .ulpi_en                = true,
        .dma_en                 = false,
};
#endif

#if VSF_USE_BOARD == ENABLED
vsf_board_t vsf_board = {
#if VSF_HAL_USE_I2C == ENABLED
    .i2c                        = (vsf_i2c_t *)&vsf_hw_i2c0,
#endif
#if VSF_USE_USB_HOST == ENABLED
    .usbh_dev                   = {
        .drv                    = &vk_dwcotg_hcd_drv,
        .param                  = (void *)&__dwcotg_hcd_param,
    },
#endif
#if VSF_USE_USB_DEVICE == ENABLED
    .dwcotg_dcd                 = {
        .param                  = &__dwcotg_dcd_param,
    },
#endif
#if VSF_HAL_USE_SDIO == ENABLED
    .sdio                       = (vsf_sdio_t *)&vsf_hw_sdio0,
    .sdio_bus_width             = 4,
    .sdio_voltage               = SD_OCR_VDD_32_33 | SD_OCR_VDD_33_34,
#endif
#if VSF_USE_UI == ENABLED && VSF_DISP_USE_FB == ENABLED
    .hw_fb                      = {
        .type                   = VSF_HW_FB_RGB,
        .width                  = VSF_BOARD_RGBLCD_WIDTH,
        .height                 = VSF_BOARD_RGBLCD_HEIGHT,
        .pixel_format           = VSF_DISP_COLOR_ARGB8888,
        .timing.rgb             = {
            .fps                = VSF_BOARD_RGBLCD_FPS,
            .hsw                = VSF_BOARD_RGBLCD_HSW,
            .hbp                = VSF_BOARD_RGBLCD_HBP,
            .hfp                = VSF_BOARD_RGBLCD_HFP,
            .vsw                = VSF_BOARD_RGBLCD_VSW,
            .vbp                = VSF_BOARD_RGBLCD_VBP,
            .vfp                = VSF_BOARD_RGBLCD_VFP,
            .use_de             = true,
            .use_pixel_clk      = true,
        },
    },
    .display_fb_layer0          = {
        .param                  = {
            .height             = VSF_BOARD_RGBLCD_LAYER0_HEIGHT,
            .width              = VSF_BOARD_RGBLCD_LAYER0_WIDTH,
            .drv                = &vk_disp_drv_fb,
            .color              = VSF_BOARD_RGBLCD_LAYER0_COLOR,
        },
#ifdef VSF_BOARD_RGBLCD_LAYER0_SRAM_BUFFER_T
        .buffer                 = (void *)__vsf_hw_rgblcd_layer0_fb,
#else
        .buffer                 = (void *)0xC0000000,
#endif
        .drv                    = &vsf_disp_hw_fb_drv,
        .drv_param              = (void *)&vsf_board.hw_fb,
        .fb_size                = vsf_disp_get_pixel_format_bytesize(VSF_BOARD_RGBLCD_LAYER0_COLOR)
                                * VSF_BOARD_RGBLCD_LAYER0_WIDTH * VSF_BOARD_RGBLCD_LAYER0_HEIGHT,
        .fb_num                 = 2,        // front/bancend frame buffer
        .layer_idx              = 0,
        .layer_color            = VSF_BOARD_RGBLCD_LAYER0_COLOR,
        .layer_alpha            = 0xFF,
        .layer_area             = {
            .pos.x              = (VSF_BOARD_RGBLCD_WIDTH - VSF_BOARD_RGBLCD_LAYER0_WIDTH) / 2,
            .pos.y              = (VSF_BOARD_RGBLCD_HEIGHT - VSF_BOARD_RGBLCD_LAYER0_HEIGHT) / 2,
            .size.x             = VSF_BOARD_RGBLCD_LAYER0_WIDTH,
            .size.y             = VSF_BOARD_RGBLCD_LAYER0_HEIGHT,
        },
    },
    .display_dev                = NULL,
    .bl_port                    = (vsf_gpio_t *)&vsf_hw_gpio9,
    .rst_port                   = (vsf_gpio_t *)&vsf_hw_gpio9,
    .bl_pin                     = 10,
    .rst_pin                    = 11,
#   if      defined(VSF_BOARD_RGBLCD_LAYER1_WIDTH)                              \
        &&  defined(VSF_BOARD_RGBLCD_LAYER1_HEIGHT)                             \
        &&  defined(VSF_BOARD_RGBLCD_LAYER1_COLOR)                              \
        &&  defined(VSF_BOARD_RGBLCD_LAYER1_SRAM_BUFFER_T)
    .display_fb_layer1          = {
        .param                  = {
            .height             = VSF_BOARD_RGBLCD_LAYER1_HEIGHT,
            .width              = VSF_BOARD_RGBLCD_LAYER1_WIDTH,
            .drv                = &vk_disp_drv_fb,
            .color              = VSF_BOARD_RGBLCD_LAYER1_COLOR,
        },
        .buffer                 = (void *)__vsf_hw_rgblcd_layer1_fb,
        .drv                    = &vsf_disp_hw_fb_drv,
        .drv_param              = (void *)&vsf_board.hw_fb,
        .fb_size                = vsf_disp_get_pixel_format_bytesize(VSF_BOARD_RGBLCD_LAYER1_COLOR)
                                * VSF_BOARD_RGBLCD_LAYER1_WIDTH * VSF_BOARD_RGBLCD_LAYER1_HEIGHT,
        .fb_num                 = 2,        // front/bancend frame buffer
        .layer_idx              = 1,
        .layer_color            = VSF_BOARD_RGBLCD_LAYER1_COLOR,
        .layer_alpha            = 0xFF,
        .layer_area             = {
            .pos.x              = (VSF_BOARD_RGBLCD_WIDTH - VSF_BOARD_RGBLCD_LAYER1_WIDTH) / 2,
            .pos.y              = (VSF_BOARD_RGBLCD_HEIGHT - VSF_BOARD_RGBLCD_LAYER1_HEIGHT) / 2,
            .size.x             = VSF_BOARD_RGBLCD_LAYER1_WIDTH,
            .size.y             = VSF_BOARD_RGBLCD_LAYER1_HEIGHT,
        },
    },
#   endif
#endif
#if VSF_USE_AUDIO == ENABLED
#   if VSF_AUDIO_USE_DUMMY == ENABLED
    .audio_dev                  = &vsf_board.audio_dummy.use_as__vk_audio_dev_t,
    .audio_dummy                = {
        .drv                    = &vk_audio_dummy_drv,
    },
#   endif
#endif
};
#endif

/*============================ LOCAL VARIABLES ===============================*/
/*============================ IMPLEMENTATION ================================*/

#if VSF_USE_USB_DEVICE == ENABLED
vsf_usb_dc_from_dwcotg_ip(0, vsf_board.dwcotg_dcd, VSF_USB_DC0)
#endif

