vsfteam/vsf.demo/board/gd32h7xx/vsf_board.c
#if     (!defined(VSF_HAL_USE_DEBUG_STREAM) || VSF_HAL_USE_DEBUG_STREAM == DISABLED)\
    &&  VSF_HAL_USE_USART == ENABLED
#   define __VSF_BOARD_USE_UART_AS_DEBUG_STREAM
#   ifndef VSF_DEBUG_STREAM_CFG_RX_BUF_SIZE
#       define VSF_DEBUG_STREAM_CFG_RX_BUF_SIZE         32
#   endif
static uint8_t __vsf_debug_stream_rx_buff[VSF_DEBUG_STREAM_CFG_RX_BUF_SIZE];
vsf_mem_stream_t VSF_DEBUG_STREAM_RX = {
    .op         = &vsf_mem_stream_op,
    .buffer     = __vsf_debug_stream_rx_buff,
    .size       = sizeof(__vsf_debug_stream_rx_buff),
};

static void __vsf_debug_stream_isrhandler(void *target, vsf_usart_t *uart,
        vsf_usart_irq_mask_t irq_mask)
{
    vsf_stream_t *stream = target;
    uint8_t *buffer;
    uint_fast32_t buflen;

    while (vsf_usart_rxfifo_get_data_count(uart) > 0) {
        buflen = vsf_stream_get_wbuf(stream, &buffer);
        if (!buflen) {
            vsf_trace_error("debug stream overflow, please increate VSF_DEBUG_STREAM_CFG_RX_BUF_SIZE\n");
            break;
        } else {
            vsf_stream_write(stream, NULL, vsf_usart_rxfifo_read(uart, buffer, buflen));
        }
    }
}

static void __VSF_DEBUG_STREAM_TX_INIT(void)
{
    vsf_usart_t *debug_usart = (vsf_usart_t *)&vsf_hw_usart1;
    vsf_err_t err;

    vsf_stream_connect_tx(&VSF_DEBUG_STREAM_RX.use_as__vsf_stream_t);
    err = vsf_usart_init(debug_usart, &(vsf_usart_cfg_t){
        .mode               = VSF_USART_8_BIT_LENGTH | VSF_USART_1_STOPBIT | VSF_USART_NO_PARITY
                            | VSF_USART_TX_ENABLE | VSF_USART_RX_ENABLE | VSF_USART_RX_FIFO_THRESHOLD_NOT_EMPTY,
        .baudrate           = 921600,
        .isr                = {
            .handler_fn     = __vsf_debug_stream_isrhandler,
            .target_ptr     = &VSF_DEBUG_STREAM_RX,
            .prio           = vsf_arch_prio_0,
        },
    });
    if (err != VSF_ERR_NONE) {
        VSF_ASSERT(false);
        return;
    }

    while (fsm_rt_cpl != vsf_usart_enable(debug_usart));
    vsf_usart_irq_enable(debug_usart, VSF_USART_IRQ_MASK_RX);
}

static void __VSF_DEBUG_STREAM_TX_WRITE_BLOCKED(uint8_t *buf, uint_fast32_t size)
{
    vsf_usart_t *debug_usart = (vsf_usart_t *)&vsf_hw_usart1;
    uint_fast16_t cur_size;

    while (size > 0) {
        cur_size = vsf_usart_txfifo_write(debug_usart, buf, size);
        if (cur_size > 0) {
            size -= cur_size;
            buf += cur_size;
        }
    }
}

// Because debug stream for RP2040 is not used,
//  VSF_HAL_USE_DEBUG_STREAM is not defined in header files.
// But debug_stream_tx_blocked.inc will need VSF_HAL_USE_DEBUG_STREAM,
//  so define VSF_HAL_USE_DEBUG_STREAM here.
#undef VSF_HAL_USE_DEBUG_STREAM
#define VSF_HAL_USE_DEBUG_STREAM        ENABLED
#include "hal/driver/common/debug_stream/debug_stream_tx_blocked.inc"
#endif

// implement strong vsf_app_driver_init to overwrite weak one in hal
bool vsf_app_driver_init(void)
{
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOA);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOB);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOC);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOD);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOE);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOF);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOG);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOH);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOJ);
    vsf_hw_peripheral_enable(VSF_HW_EN_GPIOK);
    vsf_hw_peripheral_enable(VSF_HW_EN_EXMC);
    return true;
}

void vsf_board_prepare_hw_for_linux(void)
{
#if VSF_USE_UI == ENABLED && VSF_DISP_USE_FB == ENABLED
#   ifdef APP_MSCBOOT_CFG_FLASH
    char config[16];
    if (!app_config_read("scr.valid", config, sizeof(config)) && (config[0] == '1')) {
        if (app_config_read("scr.width", config, sizeof(config))) {
            vsf_trace_error("scr.width not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        *(uint16_t *)&vsf_board.display_fb_layer0.param.width = vsf_board.hw_fb.width = atoi(config);

        if (app_config_read("scr.height", config, sizeof(config))) {
            vsf_trace_error("scr.height not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        *(uint16_t *)&vsf_board.display_fb_layer0.param.height = vsf_board.hw_fb.height = atoi(config);

        if (app_config_read("scr.fps", config, sizeof(config))) {
            vsf_trace_warning("scr.fps not configured, use 60 by default" VSF_TRACE_CFG_LINEEND);
            vsf_board.hw_fb.timing.rgb.fps = 60;
        } else {
            vsf_board.hw_fb.timing.rgb.fps = atoi(config);
        }

        if (app_config_read("scr.hsw", config, sizeof(config))) {
            vsf_trace_error("scr.hsw not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        vsf_board.hw_fb.timing.rgb.hsw = atoi(config);
        if (app_config_read("scr.hbp", config, sizeof(config))) {
            vsf_trace_error("scr.hbp not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        vsf_board.hw_fb.timing.rgb.hbp = atoi(config);
        if (app_config_read("scr.hfp", config, sizeof(config))) {
            vsf_trace_error("scr.hfp not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        vsf_board.hw_fb.timing.rgb.hfp = atoi(config);
        if (app_config_read("scr.vsw", config, sizeof(config))) {
            vsf_trace_error("scr.vsw not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        vsf_board.hw_fb.timing.rgb.vsw = atoi(config);
        if (app_config_read("scr.vbp", config, sizeof(config))) {
            vsf_trace_error("scr.vbp not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        vsf_board.hw_fb.timing.rgb.vbp = atoi(config);
        if (app_config_read("scr.vfp", config, sizeof(config))) {
            vsf_trace_error("scr.vfp not configured" VSF_TRACE_CFG_LINEEND);
            goto scr_error;
        }
        vsf_board.hw_fb.timing.rgb.vfp = atoi(config);
        vsf_board.display_dev = &vsf_board.display_fb_layer0.use_as__vk_disp_t;
    }

    return;

scr_error:
    vsf_board.display_dev = NULL;
#   else
    vsf_board.display_dev = &vsf_board.display_fb_layer0.use_as__vk_disp_t;
#   endif
#endif
    return;
}

VSF_CAL_WEAK(delay_us)
void delay_us(uint32_t us)
{
    vsf_systimer_tick_t cur_us = vsf_systimer_get_us(), due_us = cur_us + us;
    while (vsf_systimer_get_us() < due_us);
}

VSF_CAL_WEAK(delay_ms)
void delay_ms(uint32_t ms)
{
    delay_us(1000 * ms);
}

