vsfteam/vsf.demo/board/gd32h7xx/vsf_board.c
#define SDRAM_MODEREG_BURST_LENGTH_1             ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_LENGTH_2             ((uint16_t)0x0001)
#define SDRAM_MODEREG_BURST_LENGTH_4             ((uint16_t)0x0002)
#define SDRAM_MODEREG_BURST_LENGTH_8             ((uint16_t)0x0003)

#define SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL      ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_TYPE_INTERLEAVED     ((uint16_t)0x0008)

#define SDRAM_MODEREG_CAS_LATENCY_2              ((uint16_t)0x0020)
#define SDRAM_MODEREG_CAS_LATENCY_3              ((uint16_t)0x0030)

#define SDRAM_MODEREG_WRITEBURST_MODE_PROGRAMMED ((uint16_t)0x0000)
#define SDRAM_MODEREG_WRITEBURST_MODE_SINGLE     ((uint16_t)0x0200)

#define SDRAM_MODEREG_OPERATING_MODE_STANDARD    ((uint16_t)0x0000)

#define SDRAM_TIMEOUT                            ((uint32_t)0x0000FFFF)

static void __sdram_init(uint32_t sdram_device)
{
    // code below depends on 300MHz EXMC clock
    VSF_ASSERT(vsf_hw_clk_get_freq_hz(&VSF_HW_CLK_EXMC) == 300 * 1000 * 1000);

    exmc_sdram_parameter_struct sdram_init_struct;
    exmc_sdram_timing_parameter_struct sdram_timing_init_struct = {
        .load_mode_register_delay = 2,
        .exit_selfrefresh_delay = 11,
        .row_address_select_delay = 10,
        .auto_refresh_delay = 10,
        .write_recovery_delay = 2,
        .row_precharge_delay = 3,
        .row_to_column_delay = 3,
    };
    exmc_sdram_command_parameter_struct sdram_command_init_struct;

    uint32_t command_content = 0;
    uint32_t timeout = SDRAM_TIMEOUT;
    uint32_t bank_select = (EXMC_SDRAM_DEVICE0 == sdram_device) ? EXMC_SDRAM_DEVICE0_SELECT : EXMC_SDRAM_DEVICE1_SELECT;

    exmc_sdram_struct_para_init(&sdram_init_struct);

    sdram_init_struct.sdram_device = sdram_device;
    sdram_init_struct.column_address_width = EXMC_SDRAM_COW_ADDRESS_9;
    sdram_init_struct.row_address_width = EXMC_SDRAM_ROW_ADDRESS_13;
    sdram_init_struct.data_width = EXMC_SDRAM_DATABUS_WIDTH_16B;
    sdram_init_struct.internal_bank_number = EXMC_SDRAM_4_INTER_BANK;
    sdram_init_struct.cas_latency = EXMC_CAS_LATENCY_3_SDCLK;
    sdram_init_struct.write_protection = DISABLE;
    sdram_init_struct.sdclock_config = EXMC_SDCLK_PERIODS_2_CK_EXMC;
    sdram_init_struct.burst_read_switch = ENABLE;
    sdram_init_struct.pipeline_read_delay = EXMC_PIPELINE_DELAY_2_CK_EXMC;
    sdram_init_struct.timing = &sdram_timing_init_struct;
    exmc_sdram_init(&sdram_init_struct);
    while((exmc_flag_get(sdram_device, EXMC_SDRAM_FLAG_NREADY) != RESET) && (timeout > 0)) {
        timeout--;
    }

    sdram_command_init_struct.command = EXMC_SDRAM_CLOCK_ENABLE;
    sdram_command_init_struct.bank_select = bank_select;
    sdram_command_init_struct.auto_refresh_number = EXMC_SDRAM_AUTO_REFLESH_1_SDCLK;
    sdram_command_init_struct.mode_register_content = 0;
    exmc_sdram_command_config(&sdram_command_init_struct);

    delay_ms(10);

    sdram_command_init_struct.command = EXMC_SDRAM_PRECHARGE_ALL;
    sdram_command_init_struct.bank_select = bank_select;
    sdram_command_init_struct.auto_refresh_number = EXMC_SDRAM_AUTO_REFLESH_1_SDCLK;
    sdram_command_init_struct.mode_register_content = 0;

    timeout = SDRAM_TIMEOUT;
    while((exmc_flag_get(sdram_device, EXMC_SDRAM_FLAG_NREADY) != RESET) && (timeout > 0)) {
        timeout--;
    }

    exmc_sdram_command_config(&sdram_command_init_struct);

    sdram_command_init_struct.command = EXMC_SDRAM_AUTO_REFRESH;
    sdram_command_init_struct.bank_select = bank_select;
    sdram_command_init_struct.auto_refresh_number = EXMC_SDRAM_AUTO_REFLESH_9_SDCLK;
    sdram_command_init_struct.mode_register_content = 0;

    timeout = SDRAM_TIMEOUT;
    while((exmc_flag_get(sdram_device, EXMC_SDRAM_FLAG_NREADY) != RESET) && (timeout > 0)) {
        timeout--;
    }

    exmc_sdram_command_config(&sdram_command_init_struct);

    command_content = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_1    |
                      SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL       |
                      SDRAM_MODEREG_CAS_LATENCY_3               |
                      SDRAM_MODEREG_OPERATING_MODE_STANDARD     |
                      SDRAM_MODEREG_WRITEBURST_MODE_SINGLE;

    sdram_command_init_struct.command = EXMC_SDRAM_LOAD_MODE_REGISTER;
    sdram_command_init_struct.bank_select = bank_select;
    sdram_command_init_struct.auto_refresh_number = EXMC_SDRAM_AUTO_REFLESH_1_SDCLK;
    sdram_command_init_struct.mode_register_content = command_content;

    timeout = SDRAM_TIMEOUT;
    while((exmc_flag_get(sdram_device, EXMC_SDRAM_FLAG_NREADY) != RESET) && (timeout > 0)) {
        timeout--;
    }

    exmc_sdram_command_config(&sdram_command_init_struct);

    exmc_sdram_refresh_count_set(7.81 * 150 - 20);

    timeout = SDRAM_TIMEOUT;
    while((exmc_flag_get(sdram_device, EXMC_SDRAM_FLAG_NREADY) != RESET) && (timeout > 0)) {
        timeout--;
    }
}

void vsf_board_init(void)
{
    static const vsf_gpio_port_cfg_pins_t __cfgs[] = {
        // USART: PA2/PA3
        {VSF_PORTA, (1 << 2) | (1 << 3), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP, 7},

        // SDRAM: PC0/PC4..PC5, PD0..PD1/PD8..PD10/PD14..PD15, PE0..PE1/PE7..PE15, PF0..PF5/PF11.PF15, PG0..PG2/PG4..PG5/PG8/PG15
        {VSF_PORTC, (1 << 0) | (3 << 4), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_85MHZ, 12},
        {VSF_PORTD, (3 << 0) | (7 << 8) | (3 << 14), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_85MHZ, 12},
        {VSF_PORTE, (3 << 0) | (0x1FF << 7), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_85MHZ, 12},
        {VSF_PORTF, (0x3F << 0) | (0x01F << 11), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_85MHZ, 12},
        {VSF_PORTG, (7 << 0) | (3 << 4) | (1 << 8) | (1 << 15), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_85MHZ, 12},
        // SDIO: PB13, PD2, PC9..PC12
#if VSF_HAL_USE_SDIO == ENABLED
        {VSF_PORTB, (1 << 13), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_100MHZ_220MHZ, 12},
        {VSF_PORTD, (1 << 2), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_100MHZ_220MHZ, 12},
        {VSF_PORTC, (1 << 12), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_FLOATING | VSF_GPIO_SPEED_100MHZ_220MHZ, 12},
        {VSF_PORTC, (7 << 9), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_100MHZ_220MHZ, 12},
#endif
#if VSF_USE_UI == ENABLED && VSF_DISP_USE_FB == ENABLED
        // back light: PJ10, reset: PJ11
        {VSF_PORTJ, (3 << 10), VSF_GPIO_OUTPUT_PUSH_PULL | VSF_GPIO_PULL_UP | VSF_GPIO_SPEED_60MHZ},
        // PA1/PA5..PA7/PA9..PA10/PA15
        // Note PA2 is shared with USART1_TX, we lost R1
        {VSF_PORTA, (1 << 1) | (7 << 5) | (3 << 9) | (1 << 15), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
        // PA8
        {VSF_PORTA, (1 << 8), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 13},
        // PB0..PB1
        {VSF_PORTB, (3 << 0), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 9},
        // PB5
        {VSF_PORTB, (1 << 5), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 3},
        // PB9..PB11
        {VSF_PORTB, (7 << 9), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
        // PC6..PC7
        {VSF_PORTC, (3 << 6), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
        // PD6
        {VSF_PORTD, (1 << 6), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
        // PE4..PE6
        {VSF_PORTE, (7 << 4), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
        // PF10
        {VSF_PORTF, (1 << 10), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
        // PG6..PG7/PG13
        {VSF_PORTG, (3 << 6) | (1 << 13), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
        // PG10/PG12
        {VSF_PORTG, (1 << 10) | (1 << 12), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 9},
        // PK2
        {VSF_PORTK, (1 << 2), VSF_GPIO_AF_PUSH_PULL | VSF_GPIO_NO_PULL_UP_DOWN | VSF_GPIO_SPEED_100MHZ_220MHZ, 14},
#endif
    };
    vsf_hw_gpio_ports_config_pins((vsf_gpio_port_cfg_pins_t *)__cfgs, dimof(__cfgs));

#ifdef __VSF_BOARD_USE_UART_AS_DEBUG_STREAM
    VSF_STREAM_INIT(&VSF_DEBUG_STREAM_RX);
    VSF_STREAM_INIT(&VSF_DEBUG_STREAM_TX);
#endif

