vsfteam/vsf.demo/board/gd32h7xx/vsf_board.c
    __sdram_init(EXMC_SDRAM_DEVICE0);

#if VSF_USE_UI == ENABLED && VSF_DISP_USE_FB == ENABLED
#   ifdef VSF_BOARD_RGBLCD_LAYER0_SRAM_BUFFER_T
    vsf_hw_mpu_add_region(  0xC0000000, 32 * 1024 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE           |
                            VSF_ARCH_MPU_EXECUTABLE             |
                            VSF_ARCH_MPU_ACCESS_FULL            |
                            VSF_ARCH_MPU_CACHABLE_WRITE_BACK_ALLOC);
#   else
    // All SDRAM MUST be write-through because for write-back,data will be in cache
    //  before a block transfer to SDRAM, which will take the bus for a long time and
    //  maybe affect normal TLI operation.
    vsf_hw_mpu_add_region(  0xC0000000, 32 * 1024 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE           |
                            VSF_ARCH_MPU_EXECUTABLE             |
                            VSF_ARCH_MPU_ACCESS_FULL            |
                            VSF_ARCH_MPU_CACHABLE_WRITE_THROUGH_NOALLOC);

    // it's a MUST to set frame buffer to write-through, no wirte allocate
    vsf_hw_mpu_add_region(  0xC0000000, 4 * 1024 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE           |
                            VSF_ARCH_MPU_NON_EXECUTABLE         |
                            VSF_ARCH_MPU_ACCESS_FULL            |
                            VSF_ARCH_MPU_CACHABLE_WRITE_THROUGH_NOALLOC);
#   endif
#else
    vsf_hw_mpu_add_region(  0xC0000000, 32 * 1024 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE           |
                            VSF_ARCH_MPU_EXECUTABLE             |
                            VSF_ARCH_MPU_ACCESS_FULL            |
                            VSF_ARCH_MPU_CACHABLE_WRITE_BACK_ALLOC);
#endif

#ifndef VSF_LINUX_CFG_HEAP_SIZE
    vsf_heap_add_memory((vsf_mem_t){
#   ifdef VSF_BOARD_RGBLCD_LAYER0_SRAM_BUFFER_T
        .buffer     = (void *)(0xC0000000),
        .size       = 32 * 1024 * 1024,
#   else
        .buffer     = (void *)(0xC0000000 + 4 * 1024 * 1024),
        .size       = 28 * 1024 * 1024,
#   endif
    });
#endif
    vsf_gpio_set(vsf_board.bl_port, 1 << vsf_board.bl_pin);
}

// WORKAROUNDS

#if __IS_COMPILER_IAR__ && (defined(__VSF_CPP__) || defined(__OOC_CPP__)) && (VSF_USE_LINUX == ENABLED)
// For IAR EWARM 9.60.2, cexit.o contains _exit and __cexit_call_dtors.
//  If __cexit_call_dtors is not implemented, link will fail with duplicate definitations for "_exit"
void __cexit_call_dtors(void) {}
#endif

#if VSF_USE_UI == ENABLED && VSF_DISP_USE_FB == ENABLED
// if TLI is enabled, and sdram is used as frame buffer, original memcpy will use
//  performance optimization to read/write multiple words in one instructions,
//  which will cause delay in accessing frame buffer by TLI.
// Implement memcpy without these instructions
void *memcpy(void *dst, const void *src, size_t n)
{
    size_t aligned_n = n & ~3, round;

    if (!((uintptr_t)dst & 3) && !((uintptr_t)src & 3) && (aligned_n > 0)) {
        uint32_t *src32 = (uint32_t *)src;
        uint32_t *dst32 = (uint32_t *)dst;
        src = (const void *)((uintptr_t)src + aligned_n);
        dst = (void *)((uintptr_t)dst + aligned_n);
        n -= aligned_n;
        aligned_n >>= 2;

        round = (aligned_n + 7) >> 3;
        switch (aligned_n & 7) {
            case 0: do {    *dst32++ = *src32++;
            case 7:         *dst32++ = *src32++;
            case 6:         *dst32++ = *src32++;
            case 5:         *dst32++ = *src32++;
            case 4:         *dst32++ = *src32++;
            case 3:         *dst32++ = *src32++;
            case 2:         *dst32++ = *src32++;
            case 1:         *dst32++ = *src32++;
            } while (--round);
        }
    }

    if (n > 0) {
        uint8_t *src8 = (uint8_t *)src;
        uint8_t *dst8 = (uint8_t *)dst;
        round = (n + 7) >> 3;
        switch (n & 7) {
            case 0: do {    *dst8++ = *src8++;
            case 7:         *dst8++ = *src8++;
            case 6:         *dst8++ = *src8++;
            case 5:         *dst8++ = *src8++;
            case 4:         *dst8++ = *src8++;
            case 3:         *dst8++ = *src8++;
            case 2:         *dst8++ = *src8++;
            case 1:         *dst8++ = *src8++;
            } while (--round);
        }
    }
    return dst;
}
#endif
